---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternTotalWidth
source: html/bdd7e8a3-b813-907b-d505-6fd1471b215f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternTotalWidth Property

"Length on side 2"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemPatternTotalWidth { get; }
```